УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДоступныеОстаткиПланируемыхПоступлений/ДоступныеОстаткиПланируемыхПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="daf8dd54-80ee-41d9-a8d1-409533bcac1a">
  <name>ДоступныеОстаткиПланируемыхПоступлений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="f0877c5a-96ab-41aa-b1ec-aaedf8abeed8">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="8473b6d2-c972-4ac9-8e68-4a1614f32769">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7c3b211d-ef93-4cd9-838b-848fbbd49bb9">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="09190e01-0557-47ca-9397-2ba761cd1562">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7a919b8d-94eb-4b87-8751-d2561646f501">
    <name>ДатаДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДоступныеОстаткиПланируемыхПоступлений/ManagerModule.bsl
#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ТекстРасчетаДоступныхОстатков")
Функция смарт_ТекстРасчетаДоступныхОстатков()

	Текст =
	РегистрыНакопления.ГрафикПоступленияТоваров.ТекстЗапросаОборотов(Ложь)
	+ РегистрыНакопления.ГрафикПоступленияТоваров.ТекстЗапросаОстатков(Ложь)
	+ "ВЫБРАТЬ
	|	Т.Номенклатура                                КАК Номенклатура,
	|	Т.Характеристика                              КАК Характеристика,
	|	Т.Склад                                       КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)  КАК Назначение,
	|	ЕСТЬNULL(ОборотыГрафика.Период,
	|		ДАТАВРЕМЯ(1,1,1))                         КАК Период,
	|	ЕСТЬNULL(ОборотыГрафика.Количество,0)         КАК Оборот,
	|	ЕСТЬNULL(ОстаткиГрафика.Количество,0)         КАК Остаток
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ЕСТЬNULL(ОборотыГрафика.КоличествоГарантийные, 0)        КАК ОборотГарантийные,
	|	ЕСТЬNULL(ОстаткиГрафика.КоличествоГарантийные, 0)        КАК ОстатокГарантийные
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|ИЗ
	|	ВтТовары КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиГрафика КАК ОстаткиГрафика
	|		ПО Т.Номенклатура   = ОстаткиГрафика.Номенклатура
	|		 И Т.Характеристика = ОстаткиГрафика.Характеристика
	|		 И Т.Склад          = ОстаткиГрафика.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОборотыГрафика КАК ОборотыГрафика
	|		ПО Т.Номенклатура   = ОборотыГрафика.Номенклатура
	|		 И Т.Характеристика = ОборотыГрафика.Характеристика
	|		 И Т.Склад          = ОборотыГрафика.Склад
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Характеристика, Склад,
	|	Период УБЫВ
	|;
	|
	|/////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура                                КАК Номенклатура,
	|	Т.Характеристика                              КАК Характеристика,
	|	Т.Склад                                       КАК Склад,
	|	ДоступныеОстаткиДоИзменения.ДатаДоступности   КАК ДатаДоступности,
	|	ДоступныеОстаткиДоИзменения.Количество        КАК Количество
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ДоступныеОстаткиДоИзменения.смартКоличествоГарантийные        КАК смартКоличествоГарантийные
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|ИЗ
	|	ВтТовары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ДоступныеОстаткиДоИзменения
	|		ПО Т.Номенклатура   = ДоступныеОстаткиДоИзменения.Номенклатура
	|		 И Т.Характеристика = ДоступныеОстаткиДоИзменения.Характеристика
	|		 И Т.Склад          = ДоступныеОстаткиДоИзменения.Склад
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Характеристика, Склад,
	|	ДатаДоступности УБЫВ";

	Возврат Текст;

КонецФункции

#КонецОбласти
